#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.Ссылка = Неопределено ИЛИ Объект.Автор = Справочники.Пользователи.ПустаяСсылка() Тогда 
		Объект.Автор = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
КонецПроцедуры
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьДоступностьЭлементовПриПервомОткрытии();
		
	Если Объект.Автор <> ПользователиКлиент.ТекущийПользователь() Тогда
		УстановитьДоступностьЭлементовДляИсполнителя();
	КонецЕсли;
	
	Если Объект.Автор = ПользователиКлиент.ТекущийПользователь() Тогда
		УстановитьДоступностьЭлементовДляАвтора();
	КонецЕсли;

	
	Если Объект.Выполнена Тогда
		 УстановитьДоступностьЭлементовКогдаВыполнена();
	КонецЕсли;
	
	
КонецПроцедуры  
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если Объект.Выполнена И Объект.Статус <> ПредопределенноеЗначение("Перечисление.СтатусыЗадачи.Исполнена") Тогда
		Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЗадачи.Исполнена"); 
		Отказ = Истина;
	КонецЕсли;                                                                           
	
КонецПроцедуры 

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("Задача записана");
КонецПроцедуры
#КонецОбласти



#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	Если Не ЗначениеЗаполнено(Объект.Описание) Тогда
		Объект.Описание = Объект.Наименование;
	КонецЕсли;
КонецПроцедуры
#КонецОбласти


#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ИсторияИзмененияЗадачи(Команда)
	Парам = Новый Структура;
	Отбор = Новый Структура;
	Отбор.Вставить("Задача", Объект.Ссылка);
	Парам.Вставить("Отбор", Отбор);     
	ОткрытьФорму("РегистрСведений.СведенияОЗадачах.ФормаСписка", Парам, ЭтотОбъект);
КонецПроцедуры
#КонецОбласти



#Область СлужебныеПроцедурыИФункции
&НаКлиенте
Процедура УстановитьДоступностьЭлементовДляИсполнителя()
	Элементы.Наименование.Доступность = Ложь;
	Элементы.Описание.Доступность = Ложь;
	Элементы.Исполнитель.Доступность = Ложь;
	Элементы.Номер.Доступность = Ложь;
	Элементы.Дата.Доступность = Ложь;
	Элементы.СрокВыполнения.Доступность = Ложь;
	
КонецПроцедуры 

Процедура УстановитьДоступностьЭлементовКогдаВыполнена() 
	Элементы.Статус.Доступность = Ложь;
	Элементы.Наименование.Доступность = Ложь;
	Элементы.Описание.Доступность = Ложь;
	Элементы.Исполнитель.Доступность = Ложь;
	Элементы.Номер.Доступность = Ложь;
	Элементы.Дата.Доступность = Ложь;
	Элементы.СрокВыполнения.Доступность = Ложь;
КонецПроцедуры  

Процедура УстановитьДоступностьЭлементовДляАвтора() 
	Элементы.Статус.Доступность = Ложь;
	КоманднаяПанель.ПодчиненныеЭлементы.ФормаВыполнить.Доступность = Ложь;
КонецПроцедуры 

Процедура УстановитьДоступностьЭлементовПриПервомОткрытии() 
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Элементы.Статус.Доступность = Ложь;
		КоманднаяПанель.ПодчиненныеЭлементы.ФормаВыполнить.Доступность = Ложь;
	Иначе
		Элементы.Статус.Доступность = Истина;
		КоманднаяПанель.ПодчиненныеЭлементы.ФормаВыполнить.Доступность = Истина;
	КонецЕсли;  

КонецПроцедуры
#КонецОбласти
