
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.Ссылка = Неопределено ИЛИ Объект.Автор = Справочники.Пользователи.ПустаяСсылка() Тогда 
		Объект.Автор = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	Если Не ЗначениеЗаполнено(Объект.Описание) Тогда
		Объект.Описание = Объект.Наименование;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Элементы.Статус.Доступность = Ложь; 
	Иначе
		Элементы.Статус.Доступность = Истина;
	КонецЕсли;  
	
	Если Объект.Исполнитель = ПользователиКлиент.ТекущийПользователь() Тогда
		
		УстановитьДоступностьЭлементовДляИсполнителя();
	КонецЕсли;
	
	
КонецПроцедуры  


&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если Объект.Выполнена И Объект.Статус <> ПредопределенноеЗначение("Перечисление.СтатусыЗадачи.Исполнена") Тогда
		Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЗадачи.Исполнена"); 
		Отказ = Истина;
	КонецЕсли;                                                                           
	
КонецПроцедуры 

&НаКлиенте
Процедура УстановитьДоступностьЭлементовДляИсполнителя()
	Элементы.Наименование.Доступность = Ложь;
	Элементы.Описание.Доступность = Ложь;
	Элементы.Исполнитель.Доступность = Ложь;
	Элементы.Номер.Доступность = Ложь;
	Элементы.Дата.Доступность = Ложь;
	Элементы.СрокВыполнения.Доступность = Ложь;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ИсторияИзмененияЗадачи(Команда)
	Парам = Новый Структура;
	Отбор = Новый Структура;
	Отбор.Вставить("Задача", Объект.Ссылка);
	Парам.Вставить("Отбор", Отбор);     
	ОткрытьФорму("РегистрСведений.СведенияОЗадачах.ФормаСписка", Парам, ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("Задача записана");
КонецПроцедуры




